Repository: EetuPalo/Avenla-Project
Catalog: Resources/ActionMessages.*.resx
Languages: fi

# ActionResult_AddToGroup
source: Add the user to a group first.
fi: Lisää käyttäjä ensin johonkin ryhmään.

# ActionResult_AttendFail
source: Could not attend the lesson!
fi: Ei voitu osallistua!

# ActionResult_AttendSuccess
source: Successfully attended the lesson
fi: Osallistut tunnille

# ActionResult_CourseCompleteFail
source: Could not mark the course as completed.
fi: Olet suorittanut kurssin!

# ActionResult_CourseCompleteSuccess
source: You have completed the course.
fi: Kurssia ei voitu suorittaa!

# ActionResult_CourseJoinFail
source: Could not join the course!
fi: Kurssille ei voitu liittyä!

# ActionResult_CourseJoinSuccess
source: Successfully joined the course
fi: Liityit kurssille

# ActionResult_EditFail
source: User edit failed!
fi: Muokkaus epäonnistui!

# ActionResult_EditSuccess
source: User edited!
fi: Muokkaus onnistui!

# ActionResult_Error
source: Error
fi: Virhe

# ActionResult_GeneralException
source: An exception occured!
fi: Virhe tapahtui toimintoa suorittaessa!

# ActionResult_GeneralFail
source: Failed
fi: Epäonnistui

# ActionResult_GoalDeleted
source: Goals deleted successfully!
fi: Tavoitetasot poistettu onnistuneesti!

# ActionResult_GoalDeletedFail
source: An exception occured when deleting goals!
fi: Tavoitetasoja ei voitu poistaa!

# ActionResult_GoalEdited
source: Goals edited successfully!
fi: Tavoitetasoja muokattu onnistuneesti!

# ActionResult_GoalSet
source: New goals set!
fi: Tavoitetasot asetettu!

# ActionResult_GoalSetAddUser
source: Goals set! Now you can add users to the group.
fi: Tavoitetasot asetettu! Voit nyt lisätä käyttäjiä ryhmään.

# ActionResult_GradeFail
source: Grading failed!
fi: Ei voitu arvioida!

# ActionResult_GradeSuccess
source: Grading successful!
fi: Arvioitu onnistuneesti!

# ActionResult_GroupCreated
source: Group created! Next you need to set up the group goals.
fi: Ryhmä luotu! Aseta seuraavaksi tavoitetasot.

# ActionResult_GroupCreatedNoGoal
source: Group created successfully!
fi: Ryhmä luotu!

# ActionResult_RoleDeleteException
source: An exception occured while deleting role. Check the list!
fi: Virhe tapahtui roolia poistettaessa!

# ActionResult_RoleDeleteFail
source: No role deleted. This is likely an error.
fi: Roolia ei voitu poistaa!

# ActionResult_RoleDeleteSuccess
source: Role deleted successfully!
fi: Rooli poistettu onnistuneesti!

# ActionResult_RoleSuccessful
source: Role created successfully!
fi: Rooli luotu onnistuneesti!

# ActionResult_UserCreated
source: User has been created!
fi: Käyttäjä luotu!

# ActionResult_UserDeleted
source: User has been deleted!
fi: Käyttäjä poistettu!

# ActionResult_UserTaken
source: Username taken!
fi: Käyttäjänimi on jo käytössä.

# ActionWarning_MultipleSkillSelect
source: A skill has been selected multiple times. One of the selections may have been overridden.
fi: Sama taito valittu kahdesti. Yksi valinnoista on poistettu.

# CreateStatus_Error
source: An error occured but the account may have still been created. Check the account list!
fi: Virhe tapahtui, mutta käyttäjä saatettiin silti luoda. Tarkista käyttäjälista!

# CreateStatus_Success1
source: User
fi: Käyttäjä

# CreateStatus_Success2
source: created successfully!
fi: luotu onnistuneesti!

# CreateStatus_UserTaken
source: Username taken!
fi: Käyttäjänimi on jo käytössä

# Stats_Avg_NoData
source: NO_DATA
fi: EI_DATAA

# ViewBag_InvalidDate
source: INVALID_DATE
fi: VIRHEELLINEN PÄIVÄMÄÄRÄ
